{"title": "160 - Writing Queries for SQL Server (2008 & R2 Edition)", "course_id": 160, "chapters": {"1": {"name": "01 - An Introduction and History of the SQL Language", "lessons": {"1": "ch01l01 - Course Introduction; What Is Covered in this Course?", "2": "ch01l02 - Course Introduction; Who Should Take this Course?", "3": "ch01l03 - Why this Course is So Important: Is It the Greatest Course Ever?", "4": "ch01l04 - What SQL Is and Isn't", "5": "ch01l05 - Terms You Should Know", "6": "ch01l06 - ISO and ANSI SQL: Who's in Charge Here?", "7": "ch01l07 - What is Transact-SQL and How Does It Fit?", "8": "ch01l08 - What Versions of SQL Server Does this Course Use?", "9": "ch01l09 - SQL Coding Conventions and T-SQL Coding Conventions, Part 1", "10": "ch01l10 - SQL Coding Conventions and T-SQL Coding Conventions, Part 2", "11": "ch01l11 - Introduction to the Databases Used in this Course", "12": "ch01l12 - How to Install the Course Database on Your Machine", "13": "ch01l13 - How to Get the Most Out of this Course, Part 1", "14": "ch01l14 - How to Get the Most Out of this Course, Part 2", "15": "ch01l15 - How the Exercises Are Designed to Help You", "16": "ch01l16 - Operating Systems, SQL Server Versions, and Differences", "17": "ch01l17 - Make Your Choices and Stick to It!", "18": "ch01l18 - Using SQL Server Management Studio", "19": "ch01l19 - How to Use the Exercises in this Course", "20": "ch01l20 - Exercise: Using SQL Server Management Studio", "21": "ch01l21 - Exercise: Installing the Course Database on Your Machine", "22": "ch01l22 - Exercise: Using Books Online to Troubleshoot and Learn"}}, "2": {"name": "02 - Writing Single Table Queries; Building Your Foundation", "lessons": {"1": "ch02l01 - Chapter Introduction: What is Included in this Chapter", "2": "ch02l02 - SQL Fundamentals: Terms You Should Know", "3": "ch02l03 - SQL Fundamentals: Things You Should Know Before You Begin Writing SQL Queries", "4": "ch02l04 - SQL Fundamentals: How to Take the Guesswork Out of Writing Queries", "5": "ch02l05 - How to Use Database Diagrams in SSMS", "6": "ch02l06 - How to Create a Database Diagram Using SQL Server Management Studio", "7": "ch02l07 - Exercise: Create Your Database Diagram for LearnItFirstWorks_Lite", "8": "ch02l08 - LearnItFirstWorks_Lite Demo: Understanding the Database (Demo)", "9": "ch02l09 - Exercise: Understanding the LearnItFirstWorks_Lite Database", "10": "ch02l10 - LearnItFirstWorks_200x Demo: Understanding the Database (Demo)", "11": "ch02l11 - SELECT: The Basics of the SELECT Statement", "12": "ch02l12 - SELECT: Column Aliases and Table Aliases", "13": "ch02l13 - ORDER BY: The Basics of the ORDER BY Clause", "14": "ch02l14 - Exercise: Writing Basic SELECT Statements and Sorting Data", "15": "ch02l15 - WHERE: Writing Single Predicate WHERE Clauses", "16": "ch02l16 - WHERE: Think Positive!", "17": "ch02l17 - WHERE: Using the Conditional Operators", "18": "ch02l18 - WHERE: Using IN and NOT IN", "19": "ch02l19 - WHERE: Using BETWEEN and NOT BETWEEN", "20": "ch02l20 - WHERE: Using LIKE for Pattern Matching, Part 1", "21": "ch02l21 - WHERE: Using LIKE for Pattern Matching, Part 2", "22": "ch02l22 - WHERE: FAQs About Working with LIKE", "23": "ch02l23 - Exercise: Writing Single Predicate Queries (Conditional Operators)", "24": "ch02l24 - Exercise: Writing Single Predicate Queries (IN, BETWEEN, and LIKE)", "25": "ch02l25 - Understanding How SQL Processes Queries and a Discussion About Using Column Aliases", "26": "ch02l26 - WHERE: Case sensitivity and Collations", "27": "ch02l27 - WHERE: Writing Multiple Predicate WHERE Clauses, Part 1", "28": "ch02l28 - WHERE: Writing Multiple Predicate WHERE Clauses, Part 2", "29": "ch02l29 - WHERE: Using AND, Or, and Parentheses Correctly", "30": "ch02l30 - WHERE: Working with Date and Time Data in All Editions of SQL Server", "31": "ch02l31 - WHERE: Working with SQL Server 2008's New Date and Time Data Types", "32": "ch02l32 - Exercise: Writing Multiple Predicate Queries", "33": "ch02l33 - Working with NULLs in Expressions", "34": "ch02l34 - Working with NULLs in the WHERE Clause", "35": "ch02l35 - Working with NULLs in Expressions, WHERE, and ORDER BY", "36": "ch02l36 - Exercise: Working with NULL Data", "37": "ch02l37 - Writing Distinct and Top Queries and the Processing Sequence for Single Table Queries", "38": "ch02l38 - Exercise: Working with TOP and DISTINCT", "39": "ch02l39 - Quality Control in SQL Statements: How Do You Know You Are Right?", "40": "ch02l40 - Using Execution Plans to Test Your Query's Performance"}}, "3": {"name": "03 - Using and Understanding Scalar Functions and Data Types", "lessons": {"1": "ch03l01 - Chapter Introduction: What Are Scalar Functions?", "2": "ch03l02 - Working with NULLs in Expressions", "3": "ch03l03 - Introduction to NULLIF, ISNULL, and COALESCE", "4": "ch03l04 - ISNULL and COALESCE: The Two Trickiest Functions You Will Ever Meet, Part 1", "5": "ch03l05 - ISNULL and COALESCE: The Two Trickiest Functions You Will Ever Meet, Part 2", "6": "ch03l06 - Exercise: Working with NULL Data in Expressions", "7": "ch03l07 - What Happens When You Mix Data Types in Expressions and Predicates?", "8": "ch03l08 - CAST and CONVERT: Two of the Most Useful Functions You Will Ever Meet", "9": "ch03l09 - Gotchas of Working with CAST and CONVERT", "10": "ch03l10 - The Style Parameter of the CONVERT Function", "11": "ch03l11 - Working with Strings (Manipulation, Capitalization, and Middle of String)", "12": "ch03l12 - Working with Strings (Trimming, Length, Replacement)", "13": "ch03l13 - Rounding and Truncating with the ROUND Function", "14": "ch03l14 - Exercise: Working with Strings", "15": "ch03l15 - Exercise: Working with the ROUND Function", "16": "ch03l16 - Functions for Working with Dates: DATEPART, DATENAME, YEAR, MONTH and more", "17": "ch03l17 - Formatting Dates with the CONVERT Function's Style Parameter", "18": "ch03l18 - DATEADD, DATEDIFF, and the Secrets They Hide", "19": "ch03l19 - SQL Server 2008's Date Data Types Overview", "20": "ch03l20 - Exercise: Working with Dates", "21": "ch03l21 - An Introduction to the CASE Statement and Using the Simple CASE Format", "22": "ch03l22 - More on Using CASE: The Searched Format and Best Practices", "23": "ch03l23 - Using CASE Statements in the SELECT Column List", "24": "ch03l24 - Using CASE in the WHERE and ORDER BY Clauses", "25": "ch03l25 - An Introduction to the Ranking and Window Functions", "26": "ch03l26 - Looking at ROW_NUMBER(), RANK(), DENSE_RANK(), and NTILE()", "27": "ch03l27 - Exercise: Working with CASE and the Windowing Functions"}}, "4": {"name": "04 - Writing JOINs and UNIONs; The Tools of the Trade", "lessons": {"1": "ch04l01 - Chapter Introduction: What is Included in this Chapter", "2": "ch04l02 - Understanding the Difference Between Set Operators and Joins", "3": "ch04l03 - UNION Queries", "4": "ch04l04 - More UNION Query Examples and Syntax", "5": "ch04l05 - EXCEPT and INTERSECT Queries", "6": "ch04l06 - Exercise: UNION Queries", "7": "ch04l07 - How to Decide When to Use a UNION or a JOIN", "8": "ch04l08 - How to Master the Art of the JOIN Through Visualization", "9": "ch04l09 - The Syntax and Types of JOINs and JOIN Conditions", "10": "ch04l10 - INNER JOIN: Writing Two Table INNER Joins, Part 1", "11": "ch04l11 - INNER JOIN: Writing Two Table INNER Joins, Part 2", "12": "ch04l12 - JOIN Style: Creating Readable, Maintainable, and Extensible Queries", "13": "ch04l13 - The Key to Understanding 95% of All JOINs", "14": "ch04l14 - Design Pattern for Two Table Foreign Key Joins", "15": "ch04l15 - The JOIN Condition is the Key to Writing JOINs", "16": "ch04l16 - ANSI-89 Syntax and WHERE Clause Processing", "17": "ch04l17 - Exercise: Writing Two Table INNER JOINs, Part 1", "18": "ch04l18 - Exercise: Writing Two Table INNER JOINs, Part 2", "19": "ch04l19 - Working with Non-Foreign Key-based JOIN Conditions", "20": "ch04l20 - Concepts of a Theta JOIN: Equi Join and Non-Equi JOINs", "21": "ch04l21 - Understanding When to Use a Self Join", "22": "ch04l22 - More on Writing Self Joins", "23": "ch04l23 - 3+ Table Joins and How SQL Server Processes Your Queries", "24": "ch04l24 - 3+ Table Joins; Visualizing the JOIN", "25": "ch04l25 - 3+ Table Joins; Understanding the How and Why", "26": "ch04l26 - Exercise: Theta JOINs and Self JOINs", "27": "ch04l27 - Exercise: 3+ Table JOINs", "28": "ch04l28 - The Mysterious OUTER JOIN", "29": "ch04l29 - LEFT and RIGHT JOINs Demystified", "30": "ch04l30 - Design Pattern for Two Table Foreign Key OUTER JOINs", "31": "ch04l31 - Examples of Writing Two Table LEFT and RIGHT JOINs", "32": "ch04l32 - Rewriting a LEFT JOIN to be a RIGHT JOIN", "33": "ch04l33 - Identifying NULLs in OUTER JOIN Results", "34": "ch04l34 - Understanding the JOIN Processing Sequence is Critical", "35": "ch04l35 - WHERE Clause or JOIN Condition: Which One to Use?", "36": "ch04l36 - Finding Only 'A' or Only 'B' (i.e. Missing Data Pattern)", "37": "ch04l37 - Self OUTER Joins; Whew!", "38": "ch04l38 - Exercise: Two Table OUTER JOINs", "39": "ch04l39 - 3+ Table OUTER JOIN Syntax and Processing Sequence", "40": "ch04l40 - More 3+ Table OUTER JOINs and Chaining", "41": "ch04l41 - ANSI-89 OUTER JOIN Sytnax", "42": "ch04l42 - Exercise: 3+ Table OUTER JOINs", "43": "ch04l43 - Bonus Exercise: INNER JOINs", "44": "ch04l44 - Bonus Exercise: 3+ Table INNER JOINs", "45": "ch04l45 - Bonus Exercise: Two Table OUTER Joins", "46": "ch04l46 - Bonus Exercise: 3+ Table OUTER Joins"}}, "5": {"name": "05 - Writing Aggregate Queries, GROUP BY, and HAVING Clauses", "lessons": {"1": "ch05l01 - Chapter Introduction: What is Included in this Chapter", "2": "ch05l02 - Understanding How Aggregates Change Everything", "3": "ch05l03 - The Basic Aggregates: Examples and Syntax", "4": "ch05l04 - How Aggregates Handle NULLs and Data Types", "5": "ch05l05 - A Tale of Three COUNTs", "6": "ch05l06 - Using GROUP BY with Aggregates", "7": "ch05l07 - GROUP BY on Multiple Columns and NULLs", "8": "ch05l08 - How Many Rows Will My Aggregate Query Return?", "9": "ch05l09 - Exercise: Using GROUP BY", "10": "ch05l10 - GROUP BY with a JOIN", "11": "ch05l11 - Pivot Tables and Cross Tab Queries", "12": "ch05l12 - Design Pattern #1 for Pivot Tables and Crosstabs", "13": "ch05l13 - Exercise: JOINs, Aggregates, and Crosstabs", "14": "ch05l14 - The HAVING Clause: A Filter for Your Aggregates", "15": "ch05l15 - How to Decide Between WHERE and HAVING", "16": "ch05l16 - Design Pattern #1 for Finding Duplicate Data (HAVING)", "17": "ch05l17 - How Many Rows Will My Aggregate Query Return? (DJ Scott Remix)", "18": "ch05l18 - Exercise: Filtering Aggregates", "19": "ch05l19 - Subtotals and Grand Totals in SQL: ROLLUP", "20": "ch05l20 - Subtotals and Grand Totals in SQL: CUBE and the GROUPING Function", "21": "ch05l21 - Subtotals and Grand Totals in SQL: GROUPING SETS", "22": "ch05l22 - Aggregates and Window Functions; Breakin' the Rulez", "23": "ch05l23 - Exercise: Advanced Aggregates"}}, "6": {"name": "06 - Complex SQL: Subqueries, CTEs, Derived Tables and More", "lessons": {"1": "ch06l01 - Chapter Introduction: What is Included in this Chapter", "2": "ch06l02 - An Introduction to Subqueries 101", "3": "ch06l03 - Simple Subqueries in the WHERE Clause", "4": "ch06l04 - How to Decide Between WHERE, HAVING, or Simple Subquery", "5": "ch06l05 - Subqueries and Operators; Know the Rules!", "6": "ch06l06 - Working with NULLs and Simple Subqueries", "7": "ch06l07 - How to Decide Between a JOIN and a Subquery", "8": "ch06l08 - Design Pattern for Finding Non-Matched Rows with a Simple Subquery", "9": "ch06l09 - Simple Subqueries in the SELECT Column List and CASE", "10": "ch06l10 - Simple Subqueries in the HAVING Clause", "11": "ch06l11 - Exercise: Writing Simple Subqueries", "12": "ch06l12 - Correlated Subqueries: Understanding the Processing Sequence", "13": "ch06l13 - Correlated Subqueries in the SELECT Column List", "14": "ch06l14 - Column Prefixes and Scoping in Subqueries", "15": "ch06l15 - Design Pattern: How to Calculate Running Totals in SQL", "16": "ch06l16 - Exercise: Writing Correlated Subqueries in the Column List", "17": "ch06l17 - Correlated Subqueries in the WHERE Clause with EXISTS()", "18": "ch06l18 - Using EXISTS() with Correlated Subqueries", "19": "ch06l19 - Design Pattern: Rewriting a Natural JOIN to Become a Subquery", "20": "ch06l20 - Design Pattern #2 for Finding Duplicate Data (EXISTS)", "21": "ch06l21 - Exercise: Writing Correlated Subqueries in the WHERE Clauses", "22": "ch06l22 - Derived Tables: What They Are and How to Use Them", "23": "ch06l23 - How to Nest Aggregates Using Derived Tables", "24": "ch06l24 - Using a Derived Table to Replace Repeated Aggregates in Subqueries", "25": "ch06l25 - Filtering on Window Functions Using Derived Tables", "26": "ch06l26 - Design Pattern #3 for Finding Duplicate Data (RANK)", "27": "ch06l27 - PIVOT and Crosstab Queries with Derived Tables", "28": "ch06l28 - Design Pattern #2 for Pivot Tables and Crosstabs", "29": "ch06l29 - Exercise: Partying Hard with Derived Tables", "30": "ch06l30 - Common Table Expressions (CTEs): What They Are and How to Use Them", "31": "ch06l31 - How to Rewrite Derived Tables to Become CTEs", "32": "ch06l32 - Nested CTEs: Syntax and Concepts", "33": "ch06l33 - Recursive Queries: An Introduction", "34": "ch06l34 - Recursive CTEs with SQL Server 2005", "35": "ch06l35 - How to Sort Recursive CTEs in SQL Server 2005", "36": "ch06l36 - SQL Server 2008's HierarchyID Data Type", "37": "ch06l37 - Recursive CTEs with SQL Server 2008", "38": "ch06l38 - Exercise: Writing CTEs"}}, "7": {"name": "07 - SQL Design Patterns", "lessons": {"1": "ch07l01 - Chapter Introduction: What is Included in this Chapter", "2": "ch07l02 - Two Table JOIN Pattern: INNER Natural JOINs", "3": "ch07l03 - Three Table JOIN Pattern: INNER Natural JOINs", "4": "ch07l04 - Two Table JOIN Pattern: OUTER Natural JOINs", "5": "ch07l05 - Two Table JOIN Pattern: Finding Only Non-Matched Rows", "6": "ch07l06 - Design Pattern #1 for Pivot Tables and Crosstabs", "7": "ch07l07 - Design Pattern #1 for Finding Duplicate Data (HAVING)", "8": "ch07l08 - Design Pattern for Finding Non-Matched Rows with a Simple Subquery", "9": "ch07l09 - How to Calculate Running Totals in SQL", "10": "ch07l10 - Design Pattern: Rewriting a Natural JOIN to Become a Subquery", "11": "ch07l11 - Design Pattern #2 for Finding Duplicate Data (EXISTS)", "12": "ch07l12 - Design Pattern #3 for Finding Duplicate Data (RANK)", "13": "ch07l13 - Design Pattern #2 for Pivot Tables and Crosstabs"}}}}