{"title": "161 - Transact-SQL Programming: SQL Server 2008 & R2", "course_id": 161, "chapters": {"1": {"name": "01 - Course Introduction and How to Get Started", "lessons": {"1": "ch01l01 - Course Introduction: What Is Covered in this Course?", "2": "ch01l02 - Who Should Take this Course?", "3": "ch01l03 - How to Get the Most Out of this Course, Part 1", "4": "ch01l04 - How to Get the Most Out of this Course, Part 2", "5": "ch01l05 - How the Exercises Are Designed to Help You", "6": "ch01l06 - SQL Coding Conventions and T-SQL Coding Conventions, Part 1", "7": "ch01l07 - SQL Coding Conventions and T-SQL Coding Conventions, Part 2", "8": "ch01l08 - What Versions of SQL Server Does this Course Use?", "9": "ch01l09 - For the Newbies: SQL Server Versions and How to Get & Install"}}, "2": {"name": "02 - T-SQL Fundamentals: Data Types, Conversion, IF, and Variables", "lessons": {"1": "ch02l01 - Chapter Introduction: What is Included in this Chapter", "2": "ch02l02 - What SQL Is and Isn't", "3": "ch02l03 - Terms You Should Know Before Taking this Course", "4": "ch02l04 - What is Transact-SQL and How Does It Fit?", "5": "ch02l05 - An Overview of SQL Server Management Studio, Part 1", "6": "ch02l06 - An Overview of SQL Server Management Studio, Part 2", "7": "ch02l07 - Using the SQL Server Configuration Manager (Instances, Aliases, and Protocols)", "8": "ch02l08 - Basics of Transact-SQL: Batches, Scripts, GO, and Statements", "9": "ch02l09 - Writing IF and PRINT Statements", "10": "ch02l10 - Multiple Conditions in IF Statements", "11": "ch02l11 - Exercise 01: Writing Basic SQL", "12": "ch02l12 - SQL Server Data Types: An Overview", "13": "ch02l13 - How to Declare and Initialize Variables", "14": "ch02l14 - Overview of SQL Server Data Types: Text, Unicode, and Collations", "15": "ch02l15 - Overview of SQL Server Data Types: Numbers", "16": "ch02l16 - Overview of SQL Server Data Types: Date and Time", "17": "ch02l17 - Overview of SQL Server Data Types: Time Zone Aware Dates", "18": "ch02l18 - Overview of SQL Server Data Types: CLOBs and BLOBs", "19": "ch02l19 - Overview of SQL Server Data Types: User-Defined Data Types", "20": "ch02l20 - Type Conversion: Converting Strings and Unicode Data", "21": "ch02l21 - Type Conversion: Converting Numbers to Strings (and Vice Versa), Part 1", "22": "ch02l22 - Type Conversion: Converting Numbers to Strings (and Vice Versa), Part 2", "23": "ch02l23 - Useful Date and Time Functions to Help with Conversions"}}, "3": {"name": "03 - Creating Tables and Other Permanent Objects", "lessons": {"1": "ch03l01 - Chapter Introduction: What is Included in this Chapter", "2": "ch03l02 - GUI vs. Hand-Writing: Why Should I Bother Learning to Script It?", "3": "ch03l03 - Scripting in the GUI: Easy Way to Learn TSQL Scripting?", "4": "ch03l04 - The CREATE TABLE Syntax", "5": "ch03l05 - Collations: What They Are and Why They Matter", "6": "ch03l06 - NULL or NOT NULL?", "7": "ch03l07 - Thoughts on Money and Decimal Data Types", "8": "ch03l08 - Primary Keys: What, Why, and How", "9": "ch03l09 - Identity Columns and Surrogate Keys, Part 1", "10": "ch03l10 - Identity Columns and Surrogate Keys, Part 2", "11": "ch03l11 - Identity Columns and Surrogate Keys, Part 3", "12": "ch03l12 - SQL Server Schemas: What They Are and How to Use Them", "13": "ch03l13 - Exercise 01: Creating Tables in T-SQL", "14": "ch03l14 - Modifying Your Table: Adding and Removing Columns", "15": "ch03l15 - Computed Columns (a.k.a. Derived Columns)", "16": "ch03l16 - ALTER TABLE: A Cautionary Tale...", "17": "ch03l17 - Exercise 02: Adding and Removing Columns", "18": "ch03l18 - SQL Constraints: Should You Use Server or Client-Side Constraints?", "19": "ch03l19 - Types of SQL Constraints", "20": "ch03l20 - Creating DEFAULT Constraints", "21": "ch03l21 - Creating CHECK Constraints", "22": "ch03l22 - Should I Use a UNIQUE Constraint or a Primary Key?", "23": "ch03l23 - Foreign Keys: What They Are and How to Use Them, Part 1", "24": "ch03l24 - Foreign Keys: What They Are and How to Use Them, Part 2", "25": "ch03l25 - Creating Database Diagrams to Help Visual Minds", "26": "ch03l26 - Exercise 03: Adding in Server-Side Constraints", "27": "ch03l27 - Exercise 04: Creating Foreign Keys", "28": "ch03l28 - Synonyms in SQL Server", "29": "ch03l29 - Creating and Managing Temporary Tables (a.k.a. Temp Tables)", "30": "ch03l30 - Creating and Managing Table Variables", "31": "ch03l31 - SELECT INTO to Create Tables", "32": "ch03l32 - Implementing EAV Models in SQL (Entity-Attribute-Value)"}}, "4": {"name": "04 - Views and User-Defined Functions", "lessons": {"1": "ch04l01 - Chapter Introduction: What is Included in this Chapter", "2": "ch04l02 - What are Views and How Can You Use Them?", "3": "ch04l03 - The Four Steps SQL Server Goes Through to Run Your Query", "4": "ch04l04 - The Basics of Execution Plans and SHOWPLAN", "5": "ch04l05 - Viewing Execution Statistics", "6": "ch04l06 - Why Are We Talking About This Now?", "7": "ch04l07 - Using Views for Cell-Based and Row-Level Security", "8": "ch04l08 - Exercise 01: Creating Views", "9": "ch04l09 - User-Defined Functions: What They Are and Why I Love 'Em, Part 1", "10": "ch04l10 - User-Defined Functions: What They Are and Why I Love 'Em, Part 2", "11": "ch04l11 - Creating Scalar UDFs: The Syntax and Basics", "12": "ch04l12 - Passing Parameters to UDFs", "13": "ch04l13 - Using Scalar Functions in CHECK and DEFAULT Constraints", "14": "ch04l14 - Real World Scalar UDFs: Working with Dates", "15": "ch04l15 - Real World Scalar UDFs: Working with Strings", "16": "ch04l16 - Exercise 02: Creating Scalar UDFs", "17": "ch04l17 - Inline UDFs: The Syntax and Basics", "18": "ch04l18 - Inline UDF or a View: Which Should You Use?", "19": "ch04l19 - Multistatement UDFs: The Syntax and Basics", "20": "ch04l20 - Real World Multistatement UDF: Building a Time Table-Valued Function", "21": "ch04l21 - Real World Multistatement UDF: Building a Numbers UDF and a Split() Function", "22": "ch04l22 - Exercise 03: Creating Table-Valued UDFs: Inline", "23": "ch04l23 - Exercise 04: Creating Table-Valued UDFs: Multistatement", "24": "ch04l24 - ORDER BY in Table UDFs and Views", "25": "ch04l25 - How to Encrypt Your Source Code"}}, "5": {"name": "05 - Indexes and Statistics: Design, Creation, and Maintenance", "lessons": {"1": "ch05l01 - Chapter Introduction: What is Included in this Chapter", "2": "ch05l02 - What are Statistics in SQL Server?", "3": "ch05l03 - How to View the Stats In Your Database", "4": "ch05l04 - How to Create Statistics Automatically and Manually", "5": "ch05l05 - Introduction to Indexes", "6": "ch05l06 - Clustered Indexes, Nonclustered Indexes, and Heaps", "7": "ch05l07 - How SQL Server Uses Indexes in Queries", "8": "ch05l08 - What Effect Does Adding a Nonclustered Index Have?", "9": "ch05l09 - How to Know Which (If Any) Index a Query Is Using", "10": "ch05l10 - CREATE INDEX Syntax", "11": "ch05l11 - SARGability: How to Determine What Indexes You Need, Part 1", "12": "ch05l12 - SARGability: How to Determine What Indexes You Need, Part 2", "13": "ch05l13 - Nonclustered Index Design: Uniqueness and Included Columns", "14": "ch05l14 - Tools for Creating \"Missing\" Indexes", "15": "ch05l15 - Scripts for Viewing \"Missing\" and Unused Indexes", "16": "ch05l16 - How Many Indexes Is Too Many?", "17": "ch05l17 - Clustered Index Design", "18": "ch05l18 - Exercise 01: Creating Indexes", "19": "ch05l19 - How to View Index Fragmentation", "20": "ch05l20 - Techniques for Defragmenting, Rebuilding, and Reorganizing Indexes", "21": "ch05l21 - How to View the Contents of Data and Index Pages", "22": "ch05l22 - Techniques for Keeping Statistics Up To Date", "23": "ch05l23 - In_Row_Data, Lob_Data, and Row_Overflow_Data"}}, "6": {"name": "06 - Inserting, Updating, and Deleting Data", "lessons": {"1": "ch06l01 - Chapter Introduction: What is Included in this Chapter", "2": "ch06l02 - The Basics of INSERT", "3": "ch06l03 - Three Syntaxes for INSERT", "4": "ch06l04 - IDENTITY Columns and Inserts", "5": "ch06l05 - The OUTPUT Clause", "6": "ch06l06 - UPDATE Statements", "7": "ch06l07 - DELETE and TRUNCATE TABLE", "8": "ch06l08 - The MERGE Statement", "9": "ch06l09 - New Shortcut Syntax +=, =-, etc", "10": "ch06l10 - While Loops and Numbers & Dates Tables", "11": "ch06l11 - INSERTing and UPDATing through Views and Functions"}}, "7": {"name": "07 - Transactions and Locking", "lessons": {"1": "ch07l01 - Chapter Introduction: What is Included in this Chapter", "2": "ch07l02 - Transactions: Committing and Rolling Back Changes", "3": "ch07l03 - ACID Properties and Relational Databases", "4": "ch07l04 - Can You Nest Transactions?", "5": "ch07l05 - Savepoints within Transactions", "6": "ch07l06 - Locking in SQL Server", "7": "ch07l07 - SQL Server Lock Modes", "8": "ch07l08 - Transaction Isolation Levels, Row Versioning, and Snapshots", "9": "ch07l09 - How to Detect Locking and Blocking Problems", "10": "ch07l10 - Table Hints and Locking Hints (Hint: NOLOCK!)", "11": "ch07l11 - Strategies for Dealing with Blocking and Locking", "12": "ch07l12 - Deadlocks: What They Are and Why You Hate Them with a Passion!", "13": "ch07l13 - Design Tips for Preventing Deadlocks", "14": "ch07l14 - How Transactions Affect the Transaction Log"}}, "8": {"name": "08 - Working with DDL and DML Triggers", "lessons": {"1": "ch08l01 - Chapter Introduction: What is Included in this Chapter", "2": "ch08l02 - What Are Triggers and Why Are They So Popular?", "3": "ch08l03 - AFTER Triggers: Timing and Examples", "4": "ch08l04 - More on the Virtual Tables and Detecting Column Changes", "5": "ch08l05 - Real World Code: Audit Trail Trigger to Store Previous Value in a New Column", "6": "ch08l06 - Real World Code: Audit Trail Trigger to Audit Changes to a Separate Table", "7": "ch08l07 - Real World Code: Business Rules that Go Beyond Constraints", "8": "ch08l08 - Multiple AFTER Triggers for the Same Operation on a Table", "9": "ch08l09 - INSTEAD OF Triggers: Timing and Examples", "10": "ch08l10 - Real World Code: Ghost Deletes", "11": "ch08l11 - Real World Code: Corrections and Error Prevention with Audit Trail", "12": "ch08l12 - DDL Triggers: Auditing Changes to the Table Schema (and more)"}}, "9": {"name": "09 - Stored Procedure Design: Returning Data", "lessons": {"1": "ch09l01 - Chapter Introduction: What is Included in this Chapter", "2": "ch09l02 - What are Stored Procedures and How are They Used?", "3": "ch09l03 - Basics of Stored Procedure Syntax: Returning Data to the Client", "4": "ch09l04 - Stored Procedure Parameters: Input and Default Parameters", "5": "ch09l05 - Control-of-Flow and GOTO Statements", "6": "ch09l06 - The RETURN Statement and Returning Values", "7": "ch09l07 - Naming Conventions, System Stored Procedures, and the Master Database", "8": "ch09l08 - Exercise 01: Creating Stored Procedures", "9": "ch09l09 - Output Parameters: Understanding the Syntax", "10": "ch09l10 - O & R Mapping and CRUD", "11": "ch09l11 - Exercise 02: Stored Procedures with OUTPUT Parameters", "12": "ch09l12 - Consuming Stored Procedure Result Sets", "13": "ch09l13 - Stored Procedures for working with EAV Tables", "14": "ch09l14 - How to Decide Between a View, Function, or Stored Procedure", "15": "ch09l15 - What to Do When Users Have Lots of Parameter Choices", "16": "ch09l16 - Using Dynamic SQL in Stored Procedures"}}, "10": {"name": "10 - Stored Procedure Design: Performing Actions", "lessons": {"1": "ch10l01 - Chapter Introduction: What is Included in this Chapter", "2": "ch10l02 - Why You Should Use Stored Procedures to Perform Actions", "3": "ch10l03 - Implementing CRUD for a Member Object", "4": "ch10l04 - How Stored Procedures Handle Errors", "5": "ch10l05 - Controlling Transactions with Stored Procs and Triggers", "6": "ch10l06 - The Basics of TSQL Debugging", "7": "ch10l07 - Exercise 01: The Create Stored Procedure for the Member Object", "8": "ch10l08 - How to Create Custom SQL Server Error Messages", "9": "ch10l09 - The Old Way of Handling Errors: The Three Rs", "10": "ch10l10 - The New Way of Handling Errors: TRY & CATCH", "11": "ch10l11 - Exercise 02: Adding Error Handling to the Create Stored Procedure", "12": "ch10l12 - How to Marshall Result Sets from One Stored Procedure to Another", "13": "ch10l13 - Looping through Records and Result Sets: Table Variables", "14": "ch10l14 - Looping through Records and Result Sets: Temp Tables", "15": "ch10l15 - Looping through Records and Result Sets: Cursors", "16": "ch10l16 - Dynamic SQL 101: Using Stored Procedures to Stop Attacks", "17": "ch10l17 - EXECUTE AS and Ownership Chains"}}, "11": {"name": "11 - Optimization and Performance Tuning Tips", "lessons": {"1": "ch11l01 - Chapter Introduction: What is Included in this Chapter", "2": "ch11l02 - Tools for Performance Tuning SQL Server", "3": "ch11l03 - Working with SQL Profiler and Traces: Overview", "4": "ch11l04 - Working with SQL Profiler and Traces: Capturing Long Running Statements", "5": "ch11l05 - Working with SQL Profiler and Traces: Filters and Exporting", "6": "ch11l06 - Working with SQL Profiler and Traces: Aggregating and Reporting on the Results", "7": "ch11l07 - Using the Database Engine Tuning Advisor, Part 1", "8": "ch11l08 - Using the Database Engine Tuning Advisor, Part 2", "9": "ch11l09 - DMVs and DMFs: The Basics You Need to Know", "10": "ch11l10 - DMVs and DMFs Demo", "11": "ch11l11 - DMVs and DMFs: Handy Scripts You Can Use", "12": "ch11l12 - Query Hints, Table Hints, Locking Hints, Index Hints", "13": "ch11l13 - Optimizing for Ad-Hoc Workloads and Simple vs. Forced Parameterization", "14": "ch11l14 - Plan Guides", "15": "ch11l15 - Parameter Sniffing and Recompiles, Part 1", "16": "ch11l16 - Parameter Sniffing and Recompiles, Part 2", "17": "ch11l17 - DBCC FREEPROCCACHE; It Can Do Quite a Bit", "18": "ch11l18 - How to Create and View Plan Guides", "19": "ch11l19 - Optimizing Data Types: Vardecimal and Compression", "20": "ch11l20 - Optimizing Data Types: LOBs and Text & Image Data", "21": "ch11l21 - Partitions and Partitioning", "22": "ch11l22 - Tips on Bulk Loading Data, Part 1", "23": "ch11l23 - Tips on Bulk Loading Data, Part 2", "24": "ch11l24 - Indexed Views and SchemaBinding", "25": "ch11l25 - Be Wise to this Sneaky UDF Performance Stealer", "26": "ch11l26 - Using Perfmon (Performance Monitor)"}}, "12": {"name": "12 - Introduction to Working with XML Data", "lessons": {"1": "ch12l01 - Chapter Intro, New Features, Why Use XML", "2": "ch12l02 - An Overview of the FOR XML Clause: FOR XML RAW and AUTO", "3": "ch12l03 - More on Working with FOR XML: FOR XML PATH and XPath", "4": "ch12l04 - Using XQuery with the XML Data Type", "5": "ch12l05 - XML Schema Collections", "6": "ch12l06 - OPENXML and Using LET"}}, "13": {"name": "13 - Introduction to CLR Programming", "lessons": {"1": "ch13l01 - Chapter Intro and an Intro to Using SQL CLR", "2": "ch13l02 - What Type of Objects Work Well with SQL CLR?", "3": "ch13l03 - Scenario Walkthroughs: Should You Use T-SQL or the CLR?", "4": "ch13l04 - Creating CLR Assemblies and Configuring SQL Server", "5": "ch13l05 - CLR Security and Permissions; SAFE, UNSAFE, and EXTERNAL_ACCESS"}}, "14": {"name": "14 - Introduction to Working with Geospatial Data", "lessons": {"1": "ch14l01 - Chapter Intro and an Intro to Spatial Data", "2": "ch14l02 - The Geography and Geometry Data Types", "3": "ch14l03 - Data Visualization Using Maps in SSRS 2008 R2"}}, "15": {"name": "15 - Introduction to Encryption in Transact-SQL", "lessons": {"1": "ch15l01 - Chapter Intro and a Discussion of Encryption Options", "2": "ch15l02 - What Can You Encrypt?", "3": "ch15l03 - The Basics of Encryption and Cryptography", "4": "ch15l04 - How SQL Server Key and Certificate Encryption Works, Part 1", "5": "ch15l05 - How SQL Server Key and Certificate Encryption Works, Part 2"}}, "16": {"name": "16 - The Basics of Working with CLOBs and BLOBs", "lessons": {"1": "ch16l01 - Chapter Intro and the Challenges LOBs Present", "2": "ch16l02 - Understanding Full-Text Search", "3": "ch16l03 - Options for Storing and Accessing LOB Data"}}, "17": {"name": "17 - Misc Tips and Techniques", "lessons": {"1": "ch17l01 - How to Search Through Source Code for Object References", "2": "ch17l02 - HierarchyID: What It Is and How to Use It", "3": "ch17l03 - Discussion of Unit Testing Transact-SQL", "4": "ch17l04 - Source Code Management", "5": "ch17l05 - PowerShell and SqlCmd"}}}}